app/controllers/comments_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
INSERT INTO "comments" ("updated_at", "body", "post_id", "commenter", "created_at") VALUES('2009-08-23 13:16:21', 'joep', 1, 'J', '2009-08-23 13:16:21')
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params[:comment])
    if @comment.save

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
SELECT * FROM "comments" WHERE ("comments"."id" = 2 AND ("comments".post_id = 1))
---
  def edit
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])