app/controllers/posts_controller.rb

SELECT * FROM "posts" ORDER BY created_at DESC
---
  def index
    @posts = Post.all(:all, :order => 'created_at DESC')

INSERT INTO "posts" ("name", "updated_at", "title", "content", "created_at") VALUES('Joep', '2009-10-25 12:23:16', 'Apples versus Pears', 'Pears rot faster than apples. Why? Because oxygen finds an easier way to the pear''s core than to the apple''s. As a result, the pear allows more oxygen on the inside and rots faster.
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "content" = '<p>Pears rot faster than apples. Why? Because oxygen finds an easier way to the pear''s core than to the apple''s. As a result, the pear allows more oxygen on the inside and rots faster.</p>
---
  def update

    respond_to do |format|
      if @post.update_attributes(params[:post])